src/DataProcessors/ВыборИзСписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВыборИзСписка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МассивВыбора</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаВыбора</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйПодбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивПомеченных</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодстрокаПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ВыборИзСписка/Forms/Кнопки1/module.bsl
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ФормаВыбора = ЭтаФорма;
	
	ЗаполнитьТаблицуВыбора();
	
	Заголовок = ЗаголовокФормы;
	
	ВывестиТекущуюСтраницу();
	
	// для двухстрочных наименований надо уменьшить шрифт
	Если СтрЧислоСтрок( ТаблицаВыбора[0].НаименованиеДляКнопки ) = 2 Тогда
		Для НомерКнопки=1 По КолвоКнопок Цикл
			Кнопка = ЭлементыФормы["Кнопка"+НомерКнопки];
			Кнопка.Шрифт = ШрифтыСтиля.Шрифт7;
		КонецЦикла;
	КонецЕсли; 
	
	ЭлементыФормы.КнопкаОК.Видимость = МножественныйПодбор;
	
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаСтрелкаВверхНажатие(Элемент)
	
	ТекСтраница = Макс(1, ТекСтраница - 1);
	ВывестиТекущуюСтраницу();
	
КонецПроцедуры

Процедура КнопкаСтрелкаВнизНажатие(Элемент)
	
	ТекСтраница = Мин(ВсегоСтраниц, ТекСтраница + 1);
	ВывестиТекущуюСтраницу();
	
КонецПроцедуры

Процедура КнопкаВыбораНажатие(Элемент)
	
	ИндексЗначенияПервойКнопки = (ТекСтраница-1) * КолвоКнопок;
	НомерКнопки = Число(Сред(Элемент.Имя,7));
	
	ЗначениеВыбора = ТаблицаВыбора[ИндексЗначенияПервойКнопки + НомерКнопки-1].Значение;
	
	ОбработкаВыбораЗначения( ЗначениеВыбора );
	
	Если МножественныйПодбор Тогда
		Элемент.Картинка = ?(МассивПомеченных.Найти(ЗначениеВыбора), БиблиотекаКартинок.Галка, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОК(Элемент)
	
	Закрыть(МассивПомеченных);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

КолвоКнопок = 9;
